/* 
  Localizable.strings
  SoulverMathKit

  Created by Zac Cohan on 29/9/19.
  Copyright © 2019 Zac Cohan. All rights reserved.
*/


/* Line References */
//i.e line1 will be a reference to line 1
"plain text line reference" = "line";

/* Unit Categories */
"Time" = "Time";
"Acceleration" = "Acceleration";
"Length" = "Length";
"Mass" = "Mass";
"Volume" = "Volume";
"Frequency" = "Frequency";
"Angle" = "Angle";
"Temperature" = "Temperature";
"Energy" = "Energy";
"Power" = "Power";
"Pressure" = "Pressure";
"Currency" = "Currency";
"Area" = "Area";
"Speed" = "Speed";
"Data Transfer" = "Data Transfer";
"Data Storage" = "Data Storage";
"Other Unit Kind" = "Other Unit Kind";

/* Errors */
"Error: ∞" = "Error: ∞";
"Error: incompatible units" = "Error: incompatible units";
"Error: divide by zero" = "Error: divide by zero";
"Error: imaginary number" = "Error: imaginary number";
"Error: unsupported exponent unit" = "Error: unsupported exponent unit";
"Error: unsupported unit in rate" = "Error: unsupported unit in rate";

/* Positions of a custom currency symbol */
"Before" = "Before";
"Before (with space)" = "Before (with space)";
"After" = "After";
"After (with space)" = "After (with space)";

/* Labels */
"Label" = "Label";  //the default label text

/* Answer Contextual Metadata */
/* Used in the contextual menu for an answer */

/* For instance, km, a unit of distance */
"%@, a unit of %@" = "%@, a unit of %@";

/* a rate, like km per day */
"%@ per %@" = "%@ per %@";
"per %@" = "per %@";

/* days of the week, like February 12 was a Saturday, March 8 will be a Tuesday */
"%@ was a %@." = "%@ was a %@.";
"%@ will be a %@." = "%@ will be a %@.";

/* Parsing */
"a_meaning_per" = "a"; // as in "$30 a week"

/* Quick Operators */
"plusQuickOperator" = "p";
"minusQuickOperator" = "m";
"timesQuickOperator" = "x";
"divideQuickOperator" = "d";

/* SI Symbols */

/* Large */
"Y" = "Y";
"Z" = "Z";
"P" = "P";
"T" = "T";
"G" = "G";
"M" = "M";
"k" = "k";

/*  Small */
"m" = "m";
"µ" = "µ";
"n" = "n";
"p" = "p";
"f" = "f";
"z" = "z";
"y" = "y";
